GryphusWeb/app/controllers/api/v1/challenge_users_controller.rb

SELECT "challenges".* FROM "challenges" WHERE (id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = '1'))
---
      def show_disp
        @challengesdisp = Challenge.where(["id NOT IN (SELECT challenge_id FROM challenge_users WHERE user_id = ?)", params[:userid]])

SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = '1' AND fechaFin IS NULL) ORDER BY created_at DESC
---
      def show_act
        @challengeusers = ChallengeUser.where(["user_id = ? AND fechaFin IS NULL", params[:userid]]).order("created_at DESC")

SELECT "challenge_users".* FROM "challenge_users" WHERE (user_id = '1' AND fechaFin IS NOT NULL) ORDER BY created_at DESC
---
      def show_hist
        @challengeusers = ChallengeUser.where(["user_id = ? AND fechaFin IS NOT NULL", params[:userid]]).order("created_at DESC")