GryphusWeb/app/controllers/api/v1/course_users_controller.rb

      def show_disp
        @coursesdisp = Course.where(["id NOT IN (SELECT course_id FROM course_users WHERE user_id = ?)", params[:userid]])
---
SELECT "courses".* FROM "courses" WHERE (id NOT IN (SELECT course_id FROM course_users WHERE user_id = '1'))

      def show_act
        @courseusers = CourseUser.where(["user_id = ? AND fechaFin IS NULL", params[:userid]]).order("created_at DESC")
---
SELECT "course_users".* FROM "course_users" WHERE (user_id = NULL AND fechaFin IS NULL) ORDER BY created_at DESC

      def show_hist
        @courseusers = CourseUser.where(["user_id = ? AND fechaFin IS NOT NULL", params[:userid]]).order("created_at DESC")
---
SELECT "course_users".* FROM "course_users" WHERE (user_id = NULL AND fechaFin IS NOT NULL) ORDER BY created_at DESC

        def set_course_user
          @course_user = CourseUser.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]