GryphusWeb/app/controllers/complaint_users_controller.rb

  def index
    @complaint_users = ComplaintUser.all
---
SELECT "complaint_users".* FROM "complaint_users"

  def create
    @complaint_user = ComplaintUser.new(complaint_user_params)

    respond_to do |format|
      if @complaint_user.save
---
INSERT INTO "complaint_users" ("complaint_id", "user_id", "direccion", "comentarios", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["complaint_id", 1], ["user_id", 1], ["direccion", "Dir01"], ["comentarios", "Coment01"], ["created_at", "2018-07-23 17:04:42.233476"], ["updated_at", "2018-07-23 17:04:42.233476"]]

    def set_complaint_user
      @complaint_user = ComplaintUser.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "complaint_users".* FROM "complaint_users" WHERE "complaint_users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]